
# KITE P & L PROJECT

# Jay Jaiswal

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [1]:
ls

 Volume in drive C has no label.
 Volume Serial Number is F48D-B03B

 Directory of C:\Users\LEGION\python - by Abhishek sir

07-10-2025  18:52    <DIR>          .
07-10-2025  18:34    <DIR>          ..
07-10-2025  18:40    <DIR>          .ipynb_checkpoints
04-10-2025  21:50            90,640 Kite Projects JAY JAISWAL.ipynb
04-10-2025  22:11            67,514 logistic_project.Jay Jaiswal .ipynb
15-09-2025  16:10    <DIR>          numpy - lec-23
15-09-2025  18:08    <DIR>          pandas - lec-24
07-10-2025  18:38               617 Untitled.ipynb
07-10-2025  18:50            13,334 Vaccination_Project.ipynb
               4 File(s)        172,105 bytes
               5 Dir(s)  79,165,620,224 bytes free

In [5]:
df = pd.read_csv("orders.csv")

In [6]:
df.head()

             Time  Type  Instrument Product       Qty.  Avg. price     Status
0  18/12/21 10:23  SELL         SBI     CNC  1000/1000      525.25   COMPLETE
1  16/12/21 15:08   BUY    ASHOKLEY     MIS  1000/1000      125.70   COMPLETE
2  16/12/21 15:08   BUY         SBI     CNC  1000/1000      520.80   COMPLETE
3  16/12/21 14:13   BUY  TATAMOTORS     MIS    250/250      490.55   COMPLETE
4  16/12/21 13:54   BUY    ASHOKLEY     MIS     0/1000      127.10  CANCELLED

In [7]:
df.describe()

       Avg. price
count   14.000000
mean   260.825714
std    188.268428
min    124.450000
25%    125.700000
50%    125.955000
75%    490.737500
max    525.250000

In [8]:
df.shape

(14, 7)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Time        14 non-null     object
 1   Type        14 non-null     object
 2   Instrument  14 non-null     object
 3   Product     14 non-null     object
 4   Qty.        14 non-null     object
 5   Avg. price  14 non-null     float64
 6   Status      14 non-null     object
dtypes: float64(1), object(6)
memory usage: 916.0+ bytes

In [10]:
df.columns.str.lower()

Index(['time', 'type', 'instrument', 'product', 'qty.', 'avg. price',
       'status'],
      dtype='object')

In [11]:
df.columns

Index(['Time', 'Type', 'Instrument', 'Product', 'Qty.', 'Avg. price',
       'Status'],
      dtype='object')

In [12]:
col = df.columns
new = []
for i in col:
    a = i.lower()
    a = a.replace(" ","_")
    a = a.replace(".","")
    new.append(a)
new

['time', 'type', 'instrument', 'product', 'qty', 'avg_price', 'status']

In [13]:
col,new

(Index(['Time', 'Type', 'Instrument', 'Product', 'Qty.', 'Avg. price',
        'Status'],
       dtype='object'),
 ['time', 'type', 'instrument', 'product', 'qty', 'avg_price', 'status'])

In [14]:
d = dict(zip(col,new))

In [15]:
df.rename(columns=d,inplace=True)

In [16]:
df.head()

             time  type  instrument product        qty  avg_price     status
0  18/12/21 10:23  SELL         SBI     CNC  1000/1000     525.25   COMPLETE
1  16/12/21 15:08   BUY    ASHOKLEY     MIS  1000/1000     125.70   COMPLETE
2  16/12/21 15:08   BUY         SBI     CNC  1000/1000     520.80   COMPLETE
3  16/12/21 14:13   BUY  TATAMOTORS     MIS    250/250     490.55   COMPLETE
4  16/12/21 13:54   BUY    ASHOKLEY     MIS     0/1000     127.10  CANCELLED

In [17]:
df["qty"]

0     1000/1000
1     1000/1000
2     1000/1000
3       250/250
4        0/1000
5       250/250
6         0/250
7     1000/1000
8     2000/2000
9     2000/2000
10       0/2000
11    2000/2000
12    1000/1000
13    1000/1000
Name: qty, dtype: object

In [18]:
if "qty" in df.columns:
    df[["first", "second"]] = df["qty"].str.split("/", expand=True)
else:
    print("Column 'qty' does not exist in the DataFrame.")

In [19]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second
0,18/12/21 10:23,SELL,SBI,CNC,1000/1000,525.25,COMPLETE,1000,1000
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000
2,16/12/21 15:08,BUY,SBI,CNC,1000/1000,520.80,COMPLETE,1000,1000
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250
4,16/12/21 13:54,BUY,ASHOKLEY,MIS,0/1000,127.10,CANCELLED,0,1000

In [20]:
df['first']=df['first'].apply(lambda x : int(x))

In [21]:
df['second']=df['second'].apply(lambda x : int(x))

In [22]:
df["turnover"] = df["avg_price"]*df["first"]

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   time        14 non-null     object
 1   type        14 non-null     object
 2   instrument  14 non-null     object
 3   product     14 non-null     object
 4   qty         14 non-null     object
 5   avg_price   14 non-null     float64
 6   status      14 non-null     object
 7   first       14 non-null     int64
 8   second      14 non-null     int64
 9   turnover    14 non-null     float64
dtypes: float64(2), int64(2), object(6)
memory usage: 1.2+ KB

In [24]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover
0,18/12/21 10:23,SELL,SBI,CNC,1000/1000,525.25,COMPLETE,1000,1000,525250.0
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0
2,16/12/21 15:08,BUY,SBI,CNC,1000/1000,520.80,COMPLETE,1000,1000,520800.0
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5
4,16/12/21 13:54,BUY,ASHOKLEY,MIS,0/1000,127.10,CANCELLED,0,1000,0.0

In [25]:
df = df[df["turnover"] != 0]  # Keeps only rows where "trunover" is not 0

In [26]:
df.shape

(11, 10)

In [27]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover
0,18/12/21 10:23,SELL,SBI,CNC,1000/1000,525.25,COMPLETE,1000,1000,525250.0
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0
2,16/12/21 15:08,BUY,SBI,CNC,1000/1000,520.80,COMPLETE,1000,1000,520800.0
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0

In [28]:
df = df[df["product"] != "CNC"]

In [29]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0
7,16/12/21 12:39,SELL,ASHOKLEY,MIS,1000/1000,125.96,COMPLETE,1000,1000,125960.0
8,16/12/21 12:29,BUY,ASHOKLEY,MIS,2000/2000,125.70,COMPLETE,2000,2000,251400.0

In [30]:
df['Brokrage'] = 20

In [31]:
df.rename(columns={"Brokrage":"brokerage"},inplace=True)

In [32]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover,brokerage
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0,20
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5,20
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0,20
7,16/12/21 12:39,SELL,ASHOKLEY,MIS,1000/1000,125.96,COMPLETE,1000,1000,125960.0,20
8,16/12/21 12:29,BUY,ASHOKLEY,MIS,2000/2000,125.70,COMPLETE,2000,2000,251400.0,20

In [33]:
df["turnover"]*0.00025

1     31.425000
3     30.659375
5     30.756250
7     31.490000
8     62.850000
9     62.975000
11    62.975000
12    31.400000
13    31.412500
Name: turnover, dtype: float64

In [34]:
df['stt/ctt']=df.apply(lambda x : x["turnover"]*0.00025 if x['type'] == 'SELL' else 0,axis=1)

In [35]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover,brokerage,stt/ctt
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0,20,0.00000
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5,20,0.00000
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0,20,30.75625
7,16/12/21 12:39,SELL,ASHOKLEY,MIS,1000/1000,125.96,COMPLETE,1000,1000,125960.0,20,31.49000
8,16/12/21 12:29,BUY,ASHOKLEY,MIS,2000/2000,125.70,COMPLETE,2000,2000,251400.0,20,0.00000

In [36]:
df["etc_charges"] =  0.0000297

In [37]:
df["etc"]=df.apply(lambda x : x ["turnover"] * x["etc_charges"],axis = 1 )

In [38]:
df.head(1)['type']

1    BUY
Name: type, dtype: object

In [39]:
df.apply(lambda x : x['first'] + x['brokerage'],axis = 1)

1     1020
3      270
5      270
7     1020
8     2020
9     2020
11    2020
12    1020
13    1020
dtype: int64

In [40]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover,brokerage,stt/ctt,etc_charges,etc
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0,20,0.00000,0.00003,3.733290
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5,20,0.00000,0.00003,3.642334
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0,20,30.75625,0.00003,3.653843
7,16/12/21 12:39,SELL,ASHOKLEY,MIS,1000/1000,125.96,COMPLETE,1000,1000,125960.0,20,31.49000,0.00003,3.741012
8,16/12/21 12:29,BUY,ASHOKLEY,MIS,2000/2000,125.70,COMPLETE,2000,2000,251400.0,20,0.00000,0.00003,7.466580

In [41]:
df["sebi_charges"] =  0.0000297

In [42]:
df['sebi'] = df['turnover']*df["sebi_charges"]

In [43]:
df.head()

,time,type,instrument,product,qty,avg_price,status,first,second,turnover,brokerage,stt/ctt,etc_charges,etc,sebi_charges,sebi
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0,20,0.00000,0.00003,3.733290,0.00003,3.733290
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5,20,0.00000,0.00003,3.642334,0.00003,3.642334
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0,20,30.75625,0.00003,3.653843,0.00003,3.653843
7,16/12/21 12:39,SELL,ASHOKLEY,MIS,1000/1000,125.96,COMPLETE,1000,1000,125960.0,20,31.49000,0.00003,3.741012,0.00003,3.741012
8,16/12/21 12:29,BUY,ASHOKLEY,MIS,2000/2000,125.70,COMPLETE,2000,2000,251400.0,20,0.00000,0.00003,7.466580,0.00003,7.466580

GST Charges
18% on (brokerage + SEBI charges + transaction charges)

In [44]:
df['gst']=df.apply(lambda x : x['brokerage'] + x['sebi'] + x["etc"],axis = 1)

In [45]:
df["stamp_charges"] = df.apply(lambda x : x['turnover']*0.00003 if x['type']== 'BUY' else 0,axis=1)

In [46]:
df.head(1)

,time,type,instrument,product,qty,avg_price,status,first,second,turnover,brokerage,stt/ctt,etc_charges,etc,sebi_charges,sebi,gst,stamp_charges
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.7,COMPLETE,1000,1000,125700.0,20,0.0,0.00003,3.73329,0.00003,3.73329,27.46658,3.771

In [47]:
df['total_charges']=df.apply(lambda x : x['brokerage'] + x['stt/ctt'] + x["etc"]+x['sebi']+x['gst']+x['stamp_charges'],axis = 1)

# 1) Different types of charges for Individual trade

In [48]:
df

,time,type,instrument,product,qty,avg_price,status,first,second,turnover,brokerage,stt/ctt,etc_charges,etc,sebi_charges,sebi,gst,stamp_charges,total_charges
1,16/12/21 15:08,BUY,ASHOKLEY,MIS,1000/1000,125.70,COMPLETE,1000,1000,125700.0,20,0.00000,0.00003,3.733290,0.00003,3.733290,27.466580,3.771000,58.704160
3,16/12/21 14:13,BUY,TATAMOTORS,MIS,250/250,490.55,COMPLETE,250,250,122637.5,20,0.00000,0.00003,3.642334,0.00003,3.642334,27.284667,3.679125,58.248460
5,16/12/21 13:21,SELL,TATAMOTORS,MIS,250/250,492.10,COMPLETE,250,250,123025.0,20,30.75625,0.00003,3.653843,0.00003,3.653843,27.307685,0.000000,85.371620
7,16/12/21 12:39,SELL,ASHOKLEY,MIS,1000/1000,125.96,COMPLETE,1000,1000,125960.0,20,31.49000,0.00003,3.741012,0.00003,3.741012,27.482024,0.000000,86.454048
8,16/12/21 12:29,BUY,ASHOKLEY,MIS,2000/2000,125.70,COMPLETE,2000,2000,251400.0,20,0.00000,0.00003,7.466580,0.00003,7.466580,34.933160,7.542000,77.408320
9,16/12/21 11:22,SELL,ASHOKLEY,MIS,2000/2000,125.95,COMPLETE,2000,2000,251900.0,20,62.97500,0.00003,7.481430,0.00003,7.481430,34.962860,0.000000,132.900720
11,16/12/21 10:46,SELL,ASHOKLEY,MIS,2000/2000,125.95,COMPLETE,2000,2000,251900.0,20,62.97500,0.00003,7.481430,0.00003,7.481430,34.962860,0.000000,132.900720
12,16/12/21 10:24,BUY,ASHOKLEY,MIS,1000/1000,125.60,COMPLETE,1000,1000,125600.0,20,0.00000,0.00003,3.730320,0.00003,3.730320,27.460640,3.768000,58.689280
13,16/12/21 10:23,BUY,ASHOKLEY,MIS,1000/1000,125.65,COMPLETE,1000,1000,125650.0,20,0.00000,0.00003,3.731805,0.00003,3.731805,27.463610,3.769500,58.696720

# 2nd Table Work

In [49]:
weighted_avg_price = df.groupby(['instrument', 'type']).sum()

In [50]:
weighted_avg_price['weighted_avg_price'] = weighted_avg_price['turnover'] / weighted_avg_price['first']

In [51]:
charges_summary = df.groupby(['instrument', 'type'])['total_charges'].sum()

In [52]:
charges_summary = df.groupby(['instrument', 'type'])[["first",'turnover',"brokerage","stt/ctt","etc","sebi","gst","stamp_charges",'total_charges']].sum()

In [53]:
result = weighted_avg_price[['weighted_avg_price']].merge(charges_summary, on=['instrument', 'type'])

In [54]:
print(result)

                 weighted_avg_price  first  turnover  brokerage    stt/ctt  \
instrument type
ASHOKLEY   BUY              125.670   5000  628350.0         80    0.00000
           SELL             125.952   5000  629760.0         60  157.44000
TATAMOTORS BUY              490.550    250  122637.5         20    0.00000
           SELL             492.100    250  123025.0         20   30.75625

                       etc       sebi         gst  stamp_charges  \
instrument type
ASHOKLEY   BUY   18.661995  18.661995  117.323990      18.850500
           SELL  18.703872  18.703872   97.407744       0.000000
TATAMOTORS BUY    3.642334   3.642334   27.284667       3.679125
           SELL   3.653843   3.653843   27.307685       0.000000

                 total_charges
instrument type
ASHOKLEY   BUY      253.498480
           SELL     352.255488
TATAMOTORS BUY       58.248460
           SELL      85.371620

# 2) Stock wise and Type wise analysis with weighted Avg. price & calculated charges

In [55]:
pd.DataFrame(result)

                 weighted_avg_price  first  turnover  brokerage    stt/ctt  \
instrument type
ASHOKLEY   BUY              125.670   5000  628350.0         80    0.00000
           SELL             125.952   5000  629760.0         60  157.44000
TATAMOTORS BUY              490.550    250  122637.5         20    0.00000
           SELL             492.100    250  123025.0         20   30.75625

                       etc       sebi         gst  stamp_charges  \
instrument type
ASHOKLEY   BUY   18.661995  18.661995  117.323990      18.850500
           SELL  18.703872  18.703872   97.407744       0.000000
TATAMOTORS BUY    3.642334   3.642334   27.284667       3.679125
           SELL   3.653843   3.653843   27.307685       0.000000

                 total_charges
instrument type
ASHOKLEY   BUY      253.498480
           SELL     352.255488
TATAMOTORS BUY       58.248460
           SELL      85.371620

# 3nd Table Work

In [56]:
df['instrument']

1       ASHOKLEY
3     TATAMOTORS
5     TATAMOTORS
7       ASHOKLEY
8       ASHOKLEY
9       ASHOKLEY
11      ASHOKLEY
12      ASHOKLEY
13      ASHOKLEY
Name: instrument, dtype: object

In [57]:
pnl_summary = df.groupby(['instrument', 'type'])['turnover'].sum().unstack()

In [58]:
pnl_summary['Gross_PnL'] = pnl_summary['SELL'] - pnl_summary['BUY']

In [59]:
charges_summary = df.groupby(['instrument'])['total_charges'].sum()

In [60]:
pnl_summary['Total_Charges'] = charges_summary
pnl_summary['Net_PnL'] = pnl_summary['Gross_PnL'] - pnl_summary['Total_Charges']

In [61]:
pnl_summary['%_Charges_on_Gross_PnL'] = (pnl_summary['Total_Charges'] / pnl_summary['Gross_PnL']) * 100

print(pnl_summary[['Gross_PnL', 'Total_Charges', 'Net_PnL', '%_Charges_on_Gross_PnL']])

type        Gross_PnL  Total_Charges     Net_PnL  %_Charges_on_Gross_PnL
instrument
ASHOKLEY       1410.0     605.753968  804.246032               42.961274
TATAMOTORS      387.5     143.620080  243.879920               37.063246

# 3) Overall Summary of each Stocks

In [62]:
pd.DataFrame(pnl_summary)

type,BUY,SELL,Gross_PnL,Total_Charges,Net_PnL,%_Charges_on_Gross_PnL
instrument,,,,,,
ASHOKLEY,628350.0,629760.0,1410.0,605.753968,804.246032,42.961274
TATAMOTORS,122637.5,123025.0,387.5,143.620080,243.879920,37.063246

# Excel file

In [63]:
# Save to Excel
df.to_excel("1st Table Stock_Analysis.xlsx", sheet_name="Summary", index=True)

print("Excel file 'Stock_Analysis.xlsx' has been created successfully!")

Excel file 'Stock_Analysis.xlsx' has been created successfully!

In [64]:
# Save to Excel
result.to_excel("2nd Table Stock_Analysis.xlsx", sheet_name="Summary", index=True)

print("Excel file 'Stock_Analysis.xlsx' has been created successfully!")

Excel file 'Stock_Analysis.xlsx' has been created successfully!

In [65]:
# Save to Excel
pnl_summary.to_excel("3rd Table Stock_Analysis.xlsx", sheet_name="Summary", index=True)

print("Excel file 'Stock_Analysis.xlsx' has been created successfully!")

Excel file 'Stock_Analysis.xlsx' has been created successfully!